Revit 2026 API

# BalusterPatternRemoveBaluster Method

---

Removes a baluster from the main baluster pattern.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveBaluster(
	int index
)
```
```vb
Public Sub RemoveBaluster (
	index As Integer
)
```
```cpp
public:
void RemoveBaluster(
	int index
)
```
```fsharp
member RemoveBaluster :
        index : int -> unit
```

#### Parameters

index Int32
     Baluster index.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The index index is out of range. |

#### Reference

BalusterPattern Class

Autodesk.Revit.DB.Architecture Namespace